## [Без комментариев](../../../solutions/3.1/31_i.py)

Мы надеемся, вы пишите комментарии к своему коду. Если так, то интерпретатор удаляет их перед тем, как выполнить код. Напишите программу, которая выполняет данную функцию за интерпретатор.

### Формат ввода

Вводятся строки программы.\
Признаком остановки является пустая строка.

### Формат вывода:

Каждую строку нужно очистить от комментариев.\
А если комментарий — вся строка, то выводить её не надо.

### Пример 1

__Ввод__
```plaintext
# Моя первая супер-пупер программа
print("What is your name?") #  Как тебя зовут?
name = input() #  Сохраняем имя
print(f"Hello, {name}!") #  Здороваемся# Конец моей супер-пупер программы

```

__Вывод__
```plaintext
print("What is your name?")
name = input()
print(f"Hello, {name}!")
```

### Пример 2

__Ввод__
```plaintext
# Мой первый цикл
for i in range(10): # Считаем до 10
    print(i) # выводим число

```

__Вывод__
```plaintext
for i in range(10):
    print(i)
```

## Подход к решению

Первое, что может прийти в голову начинающему изучать Python, — это использовать `str.find("#")`, чтобы найти индекс символа `#` и удалить всё, что дальше. Если строка начинается с `#`, её можно просто пропустить. Несмотря на то, что этот подход достаточно "хорош" для задач уровня Яндекса, так как проходит тесты, на самом деле он не является корректным. 

Если дать такому решению на вход его же собственный код, оно отработает неверно. Пример:

```Python
# Не правильный подход
lines = []
while (line := input()):
    if line.startswith("#"):
        pass
    else:
        index = line.find("#")
        if index > 0:
            lines.append(line[:index])
        else:
            lines.append(line)
print(*lines, sep="\n")
```

__Ввод__
```plaintext
# Не правильный подход
lines = []
while (line := input()):
    if line.startswith("#"):
        pass
    else:
        index = line.find("#")
        if index > 0:
            lines.append(line[:index])
        else:
            lines.append(line)
print(*lines, sep="\n")
```

__Вывод__
```plaintext
lines = []
while (line := input()):
    if line.startswith("
        pass
    else:
        index = line.find("
        if index > 0:
            lines.append(line[:index])
        else:
            lines.append(line)
print(*lines, sep="\n")
```

Этот подход некорректно обрабатывает строки с комментариями внутри кода или строки, содержащие символы `#` в кавычках. В итоге часть кода может быть необратимо обрезана.

Для корректного решения задачи рекомендуется использовать **стек**. Логика следующая:

1. Проходимся по каждому символу каждой строки.
2. Если символ равен `#`:
   - Если это первый символ строки, то строка целиком является комментарием.
   - Если стек пустой, значит символ `#` не находится внутри строки или кавычек, и это начало комментария после кода.
3. Если символ равен кавычке (`"` или `'`):
   - Если стек не пустой и верхний элемент стека совпадает с текущей кавычкой, это означает, что кавычка закрывается, и мы убираем её из стека.
   - Если стек пустой, текущая кавычка открывает новую строку или выражение, и мы добавляем её в стек.
