## [А роза упала на лапу Азора 5.0](../../../solutions/3.1/31_q.py)

И снова напишем программу, которая определяет, палиндромом перед нами или нет.

### Формат ввода

Вводится строка.

### Формат вывода:

Если введённая строка относится к палиндрому, то вывести YES, а иначе — NO.

### Примечание

При проверке не обращайте внимания на регистр и пробелы.

### Пример 1

__Ввод__
```plaintext
А роза упала на лапу Азора
```

__Вывод__
```plaintext
YES
```

### Пример 2

__Ввод__
```plaintext
Мама мыла раму
```

__Вывод__
```plaintext
NO
```

## Подход к решению
Вот как мы подошли к решению задачи:

1. **Удаляем пробелы и приводим строку к нижнему регистру**:  
   Для начала, чтобы упростить проверку, нам нужно избавиться от пробелов и сделать все буквы строчными. Мы используем метод [`str.maketrans`](https://docs.python.org/3/library/stdtypes.html#str.maketrans) для создания таблицы перевода, которая удаляет пробелы, а затем применяем [`str.translate`](https://docs.python.org/3/library/stdtypes.html#str.translate), чтобы убрать их из строки, это очень эффективный и быстрый метод для работы с символами. После этого вызываем `lower()`, чтобы не учитывать регистр символов. В итоге получается строка, с которой легко работать.  

   Например, если ввод:  
   ```
   А роза упала на лапу Азора
   ```
   После обработки она становится:  
   ```
   арозаупаланалапуазора
   ```

2. **Инициализируем два указателя**:  
   Для проверки, является ли строка палиндромом, мы ставим один указатель `left_index` на начало строки, а второй `right_index` — на её конец. Это нужно для того, чтобы сравнивать символы с обеих сторон.  

3. **Проверяем строку с помощью цикла**:  
   Мы запускаем цикл, который работает до тех пор, пока указатели не пересекутся. Внутри цикла сравниваем символы:  
   - Если текущие символы с обоих концов не равны, то строка точно не палиндром. В таком случае мы сразу выводим "NO" и прерываем цикл.  
   - Если символы равны, сдвигаем оба указателя к центру: увеличиваем `left_index` и уменьшаем `right_index`.  

4. **Выводим результат**:  
   Если цикл завершился без прерываний, значит, строка прошла проверку — она является палиндромом. Тогда мы выводим "YES".  

   Мы используем конструкцию `else` после цикла `while`, чтобы обработать этот случай, так как она выполняется только если цикл завершился полностью.  

   Например:  
   - Для строки `арозаупаланалапуазора` цикл завершится успешно, и мы выведем "YES".  
   - А для строки `мамамылараму` цикл прервётся на несоответствии и выведет "NO".

### Почему это работает быстро?

Вся предобработка строки (удаление пробелов и приведение к нижнему регистру) делается за $O(n)$, где $n$ — длина строки. Сравнение символов с двух концов также выполняется за $O(n)$, но цикл проходит только половину строки, так что в среднем работает ещё быстрее.\
Можно убрать предобработку и обрабатывать регистр и пробелы во время сравнения, что может быть более эффективно для входящих данных с минимальным количеством пробелов.

```python
word = input()

left_index = 0
right_index = len(word) - 1

while left_index < right_index:
    left_char = word[left_index].lower()
    right_char = word[right_index].lower()
    
    if left_char == " ":
        left_index += 1
        continue
    
    if right_char == " ":
        right_index -= 1
        continue
    
    if left_char != right_char:
        print("NO")
        break
    
    left_index += 1
    right_index -= 1

else:
    print("YES")

```
