b_test_data = [
    ("Ann", "Как Вас зовут?\nПривет, Ann", "first open test"),
    ("Bob", "Как Вас зовут?\nПривет, Bob", "second open test"),
    ("bob", "Как Вас зовут?\nПривет, bob", "print input bob lower"),
    ("\n", "Как Вас зовут?\nПривет,", "print empty input"),
    ("   ", "Как Вас зовут?\nПривет,", "print whitespace input"),
]


c_test_data = [
    ("2 + 2 = 4", "2 + 2 = 4\n2 + 2 = 4\n2 + 2 = 4", "first open test"),
    ("2 * 2 = 4", "2 * 2 = 4\n2 * 2 = 4\n2 * 2 = 4", "second open test"),
    (" ", "", "whitespace input"),
    ("\n", "", "print empty input (enter \n)"),
    ("A few Words!", "A few Words!\nA few Words!\nA few Words!", "words"),
]


d_test_data = [
    ("100", "5", "first open test"),
    ("1000", "905", "thousand"),
    ("95", "0", "without change"),
    ("1000000", "999905", "million"),
]


e_test_data = [
    ("2\n3\n10\n", "4", "first open test"),
    ("187\n43\n8041\n", "0", "second open test"),
    ("0\n43\n8041\n", "8041", "zero price"),
    ("10\n0\n1000\n", "1000", "zero weight"),
    ("1000000\n1000\n2000000000\n", "1000000000", "big numbers"),
]


f_test_data = [
    (
        "черешня\n2\n3\n10\n",
        "Чек\n    "
        "черешня - 3кг - 2руб/кг\n    "
        "Итого: 6руб\n    "
        "Внесено: 10руб\n    "
        "Сдача: 4руб",
        "first open test",
    ),
    (
        "манго\n187\n43\n8041\n",
        "Чек\n    "
        "манго - 43кг - 187руб/кг\n    "
        "Итого: 8041руб\n    "
        "Внесено: 8041руб\n    "
        "Сдача: 0руб",
        "second open test",
    ),
    (
        "Кирпичи\n187\n43\n108041\n",
        "Чек\n    "
        "Кирпичи - 43кг - 187руб/кг\n    "
        "Итого: 8041руб\n    "
        "Внесено: 108041руб\n    "
        "Сдача: 100000руб",
        "briks capitalized",
    ),
    (
        "БаНаНы\n200\n0\n0\n",
        "Чек\n    "
        "БаНаНы - 0кг - 200руб/кг\n    "
        "Итого: 0руб\n    "
        "Внесено: 0руб\n    "
        "Сдача: 0руб",
        "zero receipt",
    ),
    (
        "Черная Смородина\n500\n1\n1000\n",
        "Чек\n    "
        "Черная Смородина - 1кг - 500руб/кг\n    "
        "Итого: 500руб\n    "
        "Внесено: 1000руб\n    "
        "Сдача: 500руб",
        "two words product",
    ),
]


g_test_data = [
    ("1\n", "Купи слона!", "first open test"),
    ("3\n", "Купи слона!\nКупи слона!\nКупи слона!", "second open test"),
    ("0\n", "", "no elephants"),
    (
        "5\n",
        "Купи слона!\nКупи слона!\nКупи слона!\nКупи слона!\nКупи слона!",
        "five elephants",
    ),
    (
        "21\n",
        """Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!""",
        "lots of elephants",
    ),
]


h_test_data = [
    (
        "2\nКупи слона!\n",
        """Я больше никогда не буду писать "Купи слона!"!
Я больше никогда не буду писать "Купи слона!"!""",
        "first open test",
    ),
    (
        "3\nПопка дурак!\n",
        """Я больше никогда не буду писать "Попка дурак!"!
Я больше никогда не буду писать "Попка дурак!"!
Я больше никогда не буду писать "Попка дурак!"!""",
        "second open test",
    ),
    (
        "1\nLet's Rock!",
        """Я больше никогда не буду писать "Let's Rock!"!""",
        "single quote",
    ),
    ('1\n"\n', 'Я больше никогда не буду писать """!', "double quote"),
    (
        "3\nIt's movin'",
        """Я больше никогда не буду писать "It's movin'"!
Я больше никогда не буду писать "It's movin'"!
Я больше никогда не буду писать "It's movin'"!""",
        "single quotes",
    ),
]


i_test_data = [
    ("2\n2\n", "2", "first open test"),
    ("10\n10\n", "50", "second open test"),
    ("1\n1\n", "0", "only child"),
    ("10080\n1\n", "5040", "long week with one child"),
    ("10080\n80\n", "403200", "long week with children"),
]


j_test_data = [
    (
        "Ванечка\n832\n",
        "Группа №8.\n" "2. Ванечка.\n" "Шкафчик: 832.\n" "Кроватка: 3.",
        "first open test",
    ),
    (
        "Машенька\n141\n",
        "Группа №1.\n1. Машенька.\nШкафчик: 141.\nКроватка: 4.",
        "second open test",
    ),
    (
        "ИгНаТ\n666\n",
        "Группа №6.\n" "6. ИгНаТ.\n" "Шкафчик: 666.\n" "Кроватка: 6.",
        "diabolic test",
    ),
    (
        "олег\n000\n",
        "Группа №0.\n" "0. олег.\n" "Шкафчик: 000.\n" "Кроватка: 0.",
        "zero oleg",
    ),
    (
        "Двойное Имя\n732\n",
        "Группа №7.\n2. Двойное Имя.\nШкафчик: 732.\nКроватка: 3.",
        "double name",
    ),
    (
        "Двойное Имя\n032\n",
        "Группа №0.\n2. Двойное Имя.\nШкафчик: 032.\nКроватка: 3.",
        "group zero",
    ),
]


k_test_data = [
    (
        "1234\n",
        "2143",
        "first open test",
    ),
    ("1412\n", "4121", "second open test"),
    ("1001\n", "0110", "zeros inside"),
    ("1000\n", "0100", "thousand"),
    ("9876\n", "8967", "decreasing nums"),
]


l_test_data = [
    ("123\n99\n", "112", "first open test"),
    ("405\n839\n", "234", "second open test"),
    ("9\n2\n", "1", "nine two"),
    ("369\n741\n", "0", "filty trick"),
    ("111\n899\n", "900", "more than thousand"),
    ("0\n899\n", "899", "one zero"),
    ("345\n0\n", "345", "another zero"),
    ("0\n0\n", "0", "everything is zero"),
    ("99\n2\n", "91", "ones check"),
    ("429\n590\n", "919", "tens check"),
    ("533\n566\n", "99", "hundreds check"),
    ("123\n123\n", "246", "normal add"),
]


m_test_data = [
    ("3\n100\n", "33\n1", "first open test"),
    ("20\n500\n", "25\n0", "second open test"),
    ("100\n0\n", "0\n0", "many kids zero candy"),
    ("24\n25\n", "1\n1", "more candy"),
    ("25\n24\n", "0\n24", "more children"),
    ("1_000_000_000\n3_333_333_333\n", "3\n333333333", "big party"),
]


n_test_data = [
    ("1\n2\n3\n", "5", "first open test"),
    ("1\n1\n1\n", "3", "equal with ones"),
    ("10\n10\n10\n", "21", "equal with tens"),
    ("9\n3\n7\n", "17", "more reds than blues"),
    ("7\n3\n9\n", "17", "more blues than reds"),
    ("19\n300\n19\n", "39", "a lot of greens blue and red are equal"),
    (
        "10_000_000_000\n3_333_333_333\n3_333_333_333\n",
        "13333333334",
        "big numbers",
    ),
    ("0\n3\n33\n", "34", "zero reds"),
    ("31\n3\n0\n", "32", "zero blues"),
    ("0\n3\n0\n", "1", "all greens"),
]


o_test_data = [
    ("8\n0\n65\n", "09:05", "first open test"),
    ("10\n15\n2752\n", "08:07", "second open test"),
    ("23\n59\n0\n", "23:59", "zero delivery time"),
    ("23\n59\n1\n", "00:00", "fast delivery time"),
    ("23\n59\n1_000_000_000\n", "10:39", "very long delivery time"),
    ("19\n20\n60\n", "20:20", "check hours"),
    ("23\n20\n41\n", "00:01", "check midnight"),
    ("19\n20\n39\n", "19:59", "check minutes"),
    ("23\n21\n1441\n", "23:22", "a few days long delivery"),
    ("00\n01\n1440\n", "00:01", "next day delivery"),
    ("20\n00\n240\n", "00:00", "at midnight"),
]


p_test_data = [
    ("10\n32\n5\n", "4.40", "first open test"),
    ("1\n100\n30\n", "3.30", "second open test"),
    ("99\n99\n60\n", "0.00", "you are here"),
    ("100\n1\n30\n", "3.30", "negative distance"),
    ("0\n1000000000\n1000000\n", "1000.00", "large distance"),
    ("0\n1\n1\n", "1.00", "small distance"),
]


q_test_data = [
    ("123\n1101\n", "136", "first open test"),
    ("783\n10110111\n", "966", "second open test"),
    ("1\n10\n", "3", "one plus two"),
    ("10\n1\n", "11", "ten plus one"),
    ("10\n100\n", "14", "ten plus four"),
    ("0\n0\n", "0", "zeros"),
    (
        "1\n10011101010111010011000011010111001100100101000111001011001011\n",
        "2834818284402275020",
        "big binary number",
    ),
    (
        "329_000_000\n10011101010111010011000011010111001100100101000111001011001011\n",
        "2834818284731275019",
        "big numbers",
    ),
]


r_test_data = [
    ("1001001\n100\n", "27", "first open test"),
    ("101111100\n500\n", "120", "second open test"),
    ("1111111\n127\n", "0", "no change"),
    (
        "10110000100100001001000110011011000100010100\n12_131_242_312_532_227\n",
        "12119108877242351",
        "big numbers",
    ),
    ("1100100\n100\n", "0", "no change two"),
    ("1111011011\n988\n", "1", "smallest change"),
    ("0\n100\n", "100", "zero reciept"),
    ("00000\n100\n", "100", "zero reciept two"),
]


s_test_data = [
    (
        "черешня\n2\n3\n10\n",
        "================Чек================\n"
        "Товар:                      черешня\n"
        "Цена:                 3кг * 2руб/кг\n"
        "Итого:                         6руб\n"
        "Внесено:                      10руб\n"
        "Сдача:                         4руб\n"
        "===================================",
        "first open test",
    ),
    (
        "манго\n187\n43\n8041\n",
        "================Чек================\n"
        "Товар:                        манго\n"
        "Цена:              43кг * 187руб/кг\n"
        "Итого:                      8041руб\n"
        "Внесено:                    8041руб\n"
        "Сдача:                         0руб\n"
        "===================================",
        "second open test",
    ),
    (
        "длинное раздельное название\n187\n43\n8041\n",
        "================Чек================\n"
        "Товар:  длинное раздельное название\n"
        "Цена:              43кг * 187руб/кг\n"
        "Итого:                      8041руб\n"
        "Внесено:                    8041руб\n"
        "Сдача:                         0руб\n"
        "===================================",
        "long product name",
    ),
    (
        ".\n187\n43\n8041\n",
        "================Чек================\n"
        "Товар:                            .\n"
        "Цена:              43кг * 187руб/кг\n"
        "Итого:                      8041руб\n"
        "Внесено:                    8041руб\n"
        "Сдача:                         0руб\n"
        "===================================",
        "short product name",
    ),
    (
        "ВотВСамыйРазНазвниеПродукта!?\n187\n43\n8041\n",
        "================Чек================\n"
        "Товар:ВотВСамыйРазНазвниеПродукта!?\n"
        "Цена:              43кг * 187руб/кг\n"
        "Итого:                      8041руб\n"
        "Внесено:                    8041руб\n"
        "Сдача:                         0руб\n"
        "===================================",
        "full length product name",
    ),
    (
        "ЯбЛоКи\n18700000000002139\n1\n18700000000002150\n",
        "================Чек================\n"
        "Товар:                       ЯбЛоКи\n"
        "Цена: 1кг * 18700000000002139руб/кг\n"
        "Итого:         18700000000002139руб\n"
        "Внесено:       18700000000002150руб\n"
        "Сдача:                        11руб\n"
        "===================================",
        "very expensive apples",
    ),
    (
        "Сосиски\n130\n3\n187000000000000000002150\n",
        "================Чек================\n"
        "Товар:                      Сосиски\n"
        "Цена:               3кг * 130руб/кг\n"
        "Итого:                       390руб\n"
        "Внесено:187000000000000000002150руб\n"
        "Сдача:  187000000000000000001760руб\n"
        "===================================",
        "very solid bill",
    ),
    (
        "Сосиски\n130\n3123221312348\n500000000000000\n",
        "================Чек================\n"
        "Товар:                      Сосиски\n"
        "Цена:   3123221312348кг * 130руб/кг\n"
        "Итого:           406018770605240руб\n"
        "Внесено:         500000000000000руб\n"
        "Сдача:            93981229394760руб\n"
        "===================================",
        "a lot of weight",
    ),
    (
        "Золото\n50000000000\n40000000\n200000000000000000002150\n",
        "================Чек================\n"
        "Товар:                       Золото\n"
        "Цена:40000000кг * 50000000000руб/кг\n"
        "Итого:       2000000000000000000руб\n"
        "Внесено:200000000000000000002150руб\n"
        "Сдача:  199998000000000000002150руб\n"
        "===================================",
        "buy in bulk",
    ),
]


t_test_data = [
    ("32\n285\n300\n240\n", "24 8", "first open test"),
    ("2\n175\n200\n150\n", "1 1", "minimal values test"),
    ("20\n350\n400\n300\n", "10 10", "equal weights test"),
    ("50\n300\n500\n300\n", "0 50", "all cutlets second type test"),
    ("50\n500\n500\n300\n", "50 0", "all cutlets first type test"),
    ("1000\n350\n400\n300\n", "500 500", "large values test"),
    ("10\n150\n200\n100\n", "5 5", "close price values test"),
    ("4\n250\n300\n200\n", "2 2", "integer results test"),
]
