a_test_data = [
    (
        "Аня\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Аня!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "first open test",
    ),
    (
        "Боря\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Боря!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "second open test",
    ),
    (
        "\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, !\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "empty name good",
    ),
    (
        "\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, !\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "empty name bad",
    ),
    (
        " \nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте,  !\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "whitespace good",
    ),
    (
        " \nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте,  !\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "whitespace bad",
    ),
    (
        "CaMeL\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, CaMeL!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "CaMeLcAsE good",
    ),
    (
        "CaMeL\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, CaMeL!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "CaMeLcAsE bad",
    ),
    (
        "Баба Яга\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Баба Яга!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "double name good",
    ),
    (
        "Баба Яга\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Баба Яга!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "double name bad",
    ),
]


b_test_data = [
    ("10\n5\n", "Петя\n", "first open test"),
    ("5\n7\n", "Вася\n", "second open test"),
    ("0\n5\n", "Вася\n", "zero speed one"),
    ("10\n0\n", "Петя\n", "zero speed two"),
    ("4.99\n4\n", "Петя\n", "float speed one"),
    ("10\n10.01\n", "Вася\n", "float speed two"),
    ("10.02\n10.01\n", "Петя\n", "float first greater"),
    ("10.01\n10.02\n", "Вася\n", "float second greater"),
    ("10.000000002\n10.000000001\n", "Петя\n", "float first bit greater"),
    ("10.000000001\n10.000000002\n", "Вася\n", "float second bit greater"),
]
