a_test_data = [
    (
        "Аня\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Аня!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "first open test",
    ),
    (
        "Боря\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Боря!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "second open test",
    ),
    (
        "\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, !\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "empty name good",
    ),
    (
        "\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, !\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "empty name bad",
    ),
    (
        " \nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте,  !\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "whitespace good",
    ),
    (
        " \nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте,  !\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "whitespace bad",
    ),
    (
        "CaMeL\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, CaMeL!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "CaMeLcAsE good",
    ),
    (
        "CaMeL\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, CaMeL!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "CaMeLcAsE bad",
    ),
    (
        "Баба Яга\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Баба Яга!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "double name good",
    ),
    (
        "Баба Яга\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Баба Яга!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "double name bad",
    ),
]
