a_test_data = [
    (
        "Аня\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Аня!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "first open test",
    ),
    (
        "Боря\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Боря!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "second open test",
    ),
    (
        "\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, !\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "empty name good",
    ),
    (
        "\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, !\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "empty name bad",
    ),
    (
        " \nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте,  !\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "whitespace good",
    ),
    (
        " \nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте,  !\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "whitespace bad",
    ),
    (
        "CaMeL\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, CaMeL!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "CaMeLcAsE good",
    ),
    (
        "CaMeL\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, CaMeL!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "CaMeLcAsE bad",
    ),
    (
        "Баба Яга\nхорошо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Баба Яга!\n"
        "Как дела?\n"
        "Я за вас рада!\n",
        "double name good",
    ),
    (
        "Баба Яга\nплохо\n",
        "Как Вас зовут?\n"
        "Здравствуйте, Баба Яга!\n"
        "Как дела?\n"
        "Всё наладится!\n",
        "double name bad",
    ),
]


b_test_data = [
    ("10\n5\n", "Петя\n", "first open test"),
    ("5\n7\n", "Вася\n", "second open test"),
    ("0\n5\n", "Вася\n", "zero speed one"),
    ("10\n0\n", "Петя\n", "zero speed two"),
    ("4.99\n4\n", "Петя\n", "float speed one"),
    ("10\n10.01\n", "Вася\n", "float speed two"),
    ("10.02\n10.01\n", "Петя\n", "float first greater"),
    ("10.01\n10.02\n", "Вася\n", "float second greater"),
    ("10.000000002\n10.000000001\n", "Петя\n", "float first bit greater"),
    ("10.000000001\n10.000000002\n", "Вася\n", "float second bit greater"),
]


c_test_data = [
    ("10\n5\n7\n", "Петя\n", "first open test"),
    ("5\n7\n10\n", "Толя\n", "second open test"),
    ("5\n10\n7\n", "Вася\n", "vasya wins"),
    ("10.3\n10.2\n10.1\n", "Петя\n", "float petya wins"),
    ("10.1\n10.2\n10.3\n", "Толя\n", "float tolya wins"),
    ("10.1\n10.3\n10.2\n", "Вася\n", "float vasya wins"),
    (
        "0.0000000000000003\n0.0000000000000002\n0.0000000000000001\n",
        "Петя\n",
        "small float petya wins",
    ),
    (
        "0.0000000000000001\n0.0000000000000002\n0.0000000000000003\n",
        "Толя\n",
        "small float tolya wins",
    ),
    (
        "0.0000000000000001\n0.0000000000000003\n0.0000000000000002\n",
        "Вася\n",
        "small float vasya wins",
    ),
    (
        "0.0000000000000003\n0\n0\n",
        "Петя\n",
        "small float and zeros petya wins",
    ),
    (
        "0\n0\n0.0000000000000003\n",
        "Толя\n",
        "small float and zeros tolya wins",
    ),
    (
        "0\n0.0000000000000003\n0\n",
        "Вася\n",
        "small float and zeros vasya wins",
    ),
    (
        "10000000000000003\n10000000000000002\n10000000000000001\n",
        "Петя\n",
        "huge int petya wins",
    ),
    (
        "10000000000000001\n10000000000000002\n10000000000000003\n",
        "Толя\n",
        "huge int tolya wins",
    ),
    (
        "10000000000000001\n10000000000000003\n10000000000000002\n",
        "Вася\n",
        "huge int vasya wins",
    ),
]


d_test_data = [
    (
        "10\n5\n7\n",  # Скорости: Петя Вася Толя
        {
            "1. Петя\n2. Толя\n3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася",
        },
        "first open test",
    ),
    (
        "10\n7\n5\n",
        {
            "1. Петя\n2. Вася\n3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя",
        },
        "first open test 2-3 swap",
    ),
    (
        "5\n7\n10\n",
        {
            "1. Толя\n2. Вася\n3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя",
        },
        "second open test",
    ),
    (
        "7\n5\n10\n",
        {
            "1. Толя\n2. Петя\n3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася",
        },
        "second open test 2-3 swap",
    ),
    (
        "5\n10\n7\n",
        {
            "1. Вася\n2. Толя\n3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя",
        },
        "third open-like test",
    ),
    (
        "7\n10\n5\n",
        {
            "1. Вася\n2. Петя\n3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя",
        },
        "third open-like test 2-3 swap",
    ),
    (
        "10.3\n10.1\n10.2\n",  # Скорости: Петя Вася Толя
        {
            "1. Петя\n2. Толя\n3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася",
        },
        "float p t v",
    ),
    (
        "10.3\n10.2\n10.1\n",
        {
            "1. Петя\n2. Вася\n3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя",
        },
        "float p v t",
    ),
    (
        "10.2\n10.3\n10.1\n",
        {
            "1. Вася\n2. Петя\n3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя",
        },
        "float v p t",
    ),
    (
        "10.1\n10.3\n10.2\n",
        {
            "1. Вася\n2. Толя\n3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя",
        },
        "float v t p",
    ),
    (
        "10.1\n10.2\n10.3\n",
        {
            "1. Толя\n2. Вася\n3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя",
        },
        "float t v p",
    ),
    (
        "10.2\n10.1\n10.3\n",
        {
            "1. Толя\n2. Петя\n3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася",
        },
        "float t p v",
    ),
    (
        "0.00000000003\n0.00000000001\n0.00000000002\n",  # Скорости: Петя Вася Толя
        {
            "1. Петя\n2. Толя\n3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася",
        },
        "small float p t v",
    ),
    (
        "0.00000000003\n0.00000000002\n0.00000000001\n",
        {
            "1. Петя\n2. Вася\n3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя",
        },
        "small float p v t",
    ),
    (
        "0.00000000002\n0.00000000003\n0.00000000001\n",
        {
            "1. Вася\n2. Петя\n3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя",
        },
        "small float v p t",
    ),
    (
        "0.00000000001\n0.00000000003\n0.00000000002\n",
        {
            "1. Вася\n2. Толя\n3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя",
        },
        "small float v t p",
    ),
    (
        "0.00000000001\n0.00000000002\n0.00000000003\n",
        {
            "1. Толя\n2. Вася\n3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя",
        },
        "small float t v p",
    ),
    (
        "0.00000000002\n0.00000000001\n0.00000000003\n",
        {
            "1. Толя\n2. Петя\n3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася",
        },
        "small float t p v",
    ),
    (
        "1000000000003\n1000000000001\n1000000000002\n",  # Скорости: Петя Вася Толя
        {
            "1. Петя\n2. Толя\n3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася\n",
            "1. Петя\n    2. Толя\n    3. Вася",
        },
        "big float p t v",
    ),
    (
        "1000000000003\n1000000000002\n1000000000001\n",
        {
            "1. Петя\n2. Вася\n3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя\n",
            "1. Петя\n    2. Вася\n    3. Толя",
        },
        "big float p v t",
    ),
    (
        "1000000000002\n1000000000003\n1000000000001\n",
        {
            "1. Вася\n2. Петя\n3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя\n",
            "1. Вася\n    2. Петя\n    3. Толя",
        },
        "big float v p t",
    ),
    (
        "1000000000001\n1000000000003\n1000000000002\n",
        {
            "1. Вася\n2. Толя\n3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя\n",
            "1. Вася\n    2. Толя\n    3. Петя",
        },
        "big float v t p",
    ),
    (
        "1000000000001\n1000000000002\n1000000000003\n",
        {
            "1. Толя\n2. Вася\n3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя\n",
            "1. Толя\n    2. Вася\n    3. Петя",
        },
        "big float t v p",
    ),
    (
        "1000000000002\n1000000000001\n1000000000003\n",
        {
            "1. Толя\n2. Петя\n3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася\n",
            "1. Толя\n    2. Петя\n    3. Вася",
        },
        "big float t p v",
    ),
]
