a_test_data = [
    (
        "картина корзина картонка\n",
        "1. картина\n2. корзина\n3. картонка\n",
        "first open test",
    ),
    (
        "Аня Боря Вова\n",
        "1. Аня\n2. Боря\n3. Вова\n",
        "second open test",
    ),
    ("один\n", "1. один\n", "one line"),
    ("один-one\n", "1. один-one\n", "one line two words"),
    (
        "   Аня      Боря     Вова      \n",
        "1. Аня\n2. Боря\n3. Вова\n",
        "trailing whitespaces",
    ),
    (
        "1 2 3 4 5 6 7 8 9 10\n",
        "1. 1\n2. 2\n3. 3\n4. 4\n5. 5\n6. 6\n7. 7\n8. 8\n9. 9\n10. 10\n",
        "ten digits",
    ),
    (
        "10 9 8 7 6 5 4 3 2 1\n",
        "1. 10\n2. 9\n3. 8\n4. 7\n5. 6\n6. 5\n7. 4\n8. 3\n9. 2\n10. 1\n",
        "ten digits reversed",
    ),
]

b_test_data = [
    (
        "Аня, Вова\nБоря, Дима, Гена\n",
        "Аня - Боря\nВова - Дима\n",
        "first open test",
    ),
    ("Аня, Вова\nБоря, Гена\n", "Аня - Боря\nВова - Гена\n", "even number"),
    (
        "Аня, Вова, Боря, Гога\nБоря, Дима, Гена, Вазген\n",
        "Аня - Боря\nВова - Дима\nБоря - Гена\nГога - Вазген\n",
        "even number two",
    ),
    ("Аня\nБоря, Гена\n", "Аня - Боря\n", "one - two"),
    ("Аня, Вова\nГена\n", "Аня - Гена\n", "two - one"),
]

c_test_data = [
    (
        "3.2 6.4 0.8\n",
        {
            "3.20\n4.00\n4.80\n5.60\n6.40\n",
            "3.2\n4.0\n4.8\n5.6\n6.4\n",
        },
        "first open test",
    ),
    (
        "3.14 10 1.57\n",
        "3.14\n4.71\n6.28\n7.85\n9.42\n",
        "second open test",
    ),
    (
        "3.14 4.21 1.07\n",
        "3.14\n4.21\n",
        "boundaries test",
    ),
    (
        "-3.14 -3.21 -0.07\n",
        "-3.14\n-3.21\n",
        "negative boundaries test",
    ),
    (
        "-3.14 4.21 1.07\n",
        {
            "-3.14\n-2.07\n-1.00\n0.07\n1.14\n2.21\n3.28\n",
            "-3.14\n-2.07\n-1.0\n0.07\n1.14\n2.21\n3.28\n",
        },
        "negative to positive",
    ),
    (
        "3.14 -4.21 -1.07\n",
        {
            "3.14\n2.07\n1.00\n-0.07\n-1.14\n-2.21\n-3.28\n",
            "3.14\n2.07\n1.0\n-0.07\n-1.14\n-2.21\n-3.28\n",
        },
        "positive to negative test",
    ),
    (
        "0 2.2 0.43\n",
        "0.00\n0.43\n0.86\n1.29\n1.72\n2.15\n",
        "zero to positive",
    ),
    (
        "0 -2.2 -0.43\n",
        "0.00\n-0.43\n-0.86\n-1.29\n-1.72\n-2.15\n",
        "zero to negative",
    ),
    ("2.3 0 -0.63\n", "2.30\n1.67\n1.04\n0.41\n", "positive to zero"),
    ("-2.3 0 0.63\n", "-2.30\n-1.67\n-1.04\n-0.41\n", "negative to zero"),
]

d_test_data = [
    (
        "мама мыла раму\n",
        "мама\nмама мыла\nмама мыла раму\n",
        "first open test",
    ),
    (
        "картина корзина картонка\n",
        "картина\n" "картина корзина\n" "картина корзина картонка\n",
        "second open test",
    ),
    ("one-line\n", "one-line\n", "one line"),
]

e_test_data = [
    (
        "картина, корзина, картонка\nмыло, манка\nмолоко, хлеб, сыр\n",
        "1. картина\n"
        "2. картонка\n"
        "3. корзина\n"
        "4. манка\n"
        "5. молоко\n"
        "6. мыло\n"
        "7. сыр\n"
        "8. хлеб\n",
        "first open test",
    ),
    (
        "картина, корзина, картонка\n\nмолоко, хлеб, сыр\n",
        "1. картина\n"
        "2. картонка\n"
        "3. корзина\n"
        "4. молоко\n"
        "5. сыр\n"
        "6. хлеб\n",
        "one empty string",
    ),
]

f_test_data = [
    (
        "треф\n",
        "2 пик\n"
        "2 бубен\n"
        "2 червей\n"
        "3 пик\n"
        "3 бубен\n"
        "3 червей\n"
        "4 пик\n"
        "4 бубен\n"
        "4 червей\n"
        "5 пик\n"
        "5 бубен\n"
        "5 червей\n"
        "6 пик\n"
        "6 бубен\n"
        "6 червей\n"
        "7 пик\n"
        "7 бубен\n"
        "7 червей\n"
        "8 пик\n"
        "8 бубен\n"
        "8 червей\n"
        "9 пик\n"
        "9 бубен\n"
        "9 червей\n"
        "10 пик\n"
        "10 бубен\n"
        "10 червей\n"
        "валет пик\n"
        "валет бубен\n"
        "валет червей\n"
        "дама пик\n"
        "дама бубен\n"
        "дама червей\n"
        "король пик\n"
        "король бубен\n"
        "король червей\n"
        "туз пик\n"
        "туз бубен\n"
        "туз червей\n",
        "first open test",
    ),
    (
        "пик\n",
        "2 треф\n"
        "2 бубен\n"
        "2 червей\n"
        "3 треф\n"
        "3 бубен\n"
        "3 червей\n"
        "4 треф\n"
        "4 бубен\n"
        "4 червей\n"
        "5 треф\n"
        "5 бубен\n"
        "5 червей\n"
        "6 треф\n"
        "6 бубен\n"
        "6 червей\n"
        "7 треф\n"
        "7 бубен\n"
        "7 червей\n"
        "8 треф\n"
        "8 бубен\n"
        "8 червей\n"
        "9 треф\n"
        "9 бубен\n"
        "9 червей\n"
        "10 треф\n"
        "10 бубен\n"
        "10 червей\n"
        "валет треф\n"
        "валет бубен\n"
        "валет червей\n"
        "дама треф\n"
        "дама бубен\n"
        "дама червей\n"
        "король треф\n"
        "король бубен\n"
        "король червей\n"
        "туз треф\n"
        "туз бубен\n"
        "туз червей\n",
        "spades",
    ),
    (
        "бубен\n",
        "2 пик\n"
        "2 треф\n"
        "2 червей\n"
        "3 пик\n"
        "3 треф\n"
        "3 червей\n"
        "4 пик\n"
        "4 треф\n"
        "4 червей\n"
        "5 пик\n"
        "5 треф\n"
        "5 червей\n"
        "6 пик\n"
        "6 треф\n"
        "6 червей\n"
        "7 пик\n"
        "7 треф\n"
        "7 червей\n"
        "8 пик\n"
        "8 треф\n"
        "8 червей\n"
        "9 пик\n"
        "9 треф\n"
        "9 червей\n"
        "10 пик\n"
        "10 треф\n"
        "10 червей\n"
        "валет пик\n"
        "валет треф\n"
        "валет червей\n"
        "дама пик\n"
        "дама треф\n"
        "дама червей\n"
        "король пик\n"
        "король треф\n"
        "король червей\n"
        "туз пик\n"
        "туз треф\n"
        "туз червей\n",
        "diamonds",
    ),
    (
        "червей\n",
        "2 пик\n"
        "2 треф\n"
        "2 бубен\n"
        "3 пик\n"
        "3 треф\n"
        "3 бубен\n"
        "4 пик\n"
        "4 треф\n"
        "4 бубен\n"
        "5 пик\n"
        "5 треф\n"
        "5 бубен\n"
        "6 пик\n"
        "6 треф\n"
        "6 бубен\n"
        "7 пик\n"
        "7 треф\n"
        "7 бубен\n"
        "8 пик\n"
        "8 треф\n"
        "8 бубен\n"
        "9 пик\n"
        "9 треф\n"
        "9 бубен\n"
        "10 пик\n"
        "10 треф\n"
        "10 бубен\n"
        "валет пик\n"
        "валет треф\n"
        "валет бубен\n"
        "дама пик\n"
        "дама треф\n"
        "дама бубен\n"
        "король пик\n"
        "король треф\n"
        "король бубен\n"
        "туз пик\n"
        "туз треф\n"
        "туз бубен\n",
        "hearts",
    ),
]

g_test_data = [
    (
        "3\nАня\nБоря\nВова\n",
        "Аня - Боря\nАня - Вова\nБоря - Вова\n",
        "first open test",
    ),
    ("2\nАня\nБоря\n", "Аня - Боря\n", "two players"),
    (
        "4\nАня\nБоря\nДжон\nЕфростинья\n",
        "Аня - Боря\n"
        "Аня - Джон\n"
        "Аня - Ефростинья\n"
        "Боря - Джон\n"
        "Боря - Ефростинья\n"
        "Джон - Ефростинья\n",
        "four players",
    ),
]

h_test_data = [
    (
        "5\nМанная\nГречневая\nПшённая\nОвсяная\nРисовая\n3\n",
        "Манная\nГречневая\nПшённая\n",
        "first open test",
    ),
    (
        "5\n"
        "Манная\n"
        "Гречневая\n"
        "Пшённая\n"
        "Овсяная\n"
        "Рисовая\n"
        "12\n",
        "Манная\n"
        "Гречневая\n"
        "Пшённая\n"
        "Овсяная\n"
        "Рисовая\n"
        "Манная\n"
        "Гречневая\n"
        "Пшённая\n"
        "Овсяная\n"
        "Рисовая\n"
        "Манная\n"
        "Гречневая\n",
        "second open test",
    ),
    (
        "5\nМанная\nГречневая\nПшённая\nОвсяная\nРисовая\n5\n",
        "Манная\nГречневая\nПшённая\nОвсяная\nРисовая\n",
        "poridge == repeats",
    ),
]
