a_test_data = [
    ("1 2\n3 4 5\n6\n7 8 9 10\n", "55\n", "first open test"),
    ("-21\n-12\n-9\n", "-42\n", "all nagative few lines"),
    ("-21 -12 -9\n", "-42\n", "all nagative one line"),
    ("0\n0 0 0 0 0\n0 0\n", "0\n", "all zeros few lines"),
    ("0 0 0 0 0 0 0 0\n", "0\n", "all zeros one line"),
    ("-10\n1 2 3 3 0\n0 1\n", "0\n", "zero sum few lines"),
    ("-10 1 2 3 3 0 0 1\n", "0\n", "zero sum one line"),
    (
        "100000\n1000000 2004234 342312323 33123443234 34255645670\n313657870 429934584672731\n",
        "430002622836062\n",
        "big sum few lines",
    ),
    (
        "100000 1000000 2004234 342312323 33123443234 34255645670 313657870 429934584672731\n",
        "430002622836062\n",
        "big sum one line",
    ),
    ("-10\n\n\n\n10\n", "0\n", "zero sum empty lines"),
]

b_test_data = [
    ("Аня 160 162\nБоря 165 172\nВова 165 165\n", "3\n", "first open test"),
    (
        "Аня 161 165\nБоря 167 172\nВова 165 166\nДима 173 178\n",
        "4\n",
        "second open test",
    ),
    ("Аня 164 162\nБоря 165 163\nВова 165 165\n", "-1\n", "negative growth"),
    (
        "Аня 165 165\nБоря 172 172\nВова 166 166\nДима 178 178\n",
        "0\n",
        "zero growth",
    ),
    (
        "Аня 160.6 162.7\nБоря 159.9 163.1\nВова 165.1 165.9\n",
        "2\n",
        "float growth",
    ),
    (
        "Аня 160 162\nБоря 159 163\nВова 165 165\nLePricon 165 159",
        "0\n",
        "negative outlier",
    ),
    (
        "Аня 166 162\nБоря 156 153\nВова 165 163\nJamal 150 159",
        "0\n",
        "positive outlier",
    ),
]

# c_test_data такая же как и для 3.1 I

# d_test_data такая же как и для 3.1 K

e_test_data = [
    (
        "Анна Боря Вова\n"
        "Я последняя буква алфавита\n"
        "Дед строит шалаш\n"
        "Шалаш был хорош\n"
        "Дед слышит топот\n"
        "Ара залетел в шалаш\n",
        "Анна\nАра\nДед\nШалаш\nЯ\nв\nтопот\nшалаш\n",
        "first open test",
    ),
    (
        "Казак был рад\n"
        "Боб увидел Анну\n"
        "Семья любит Деда\n"
        "Ара летает\n"
        "Я иду к нему\n",
        "Ара\nБоб\nКазак\nЯ\nк\n",
        "palindrome and single letter test",
    ),
    (
        "Кот ходит по дому\nСобака лает\nПтица, а поет на дереве\n",
        "а\n",
        "single letter test",
    ),
    (
        "Радар Малам Карек\nКак дошел до топора\nЯ и он в арке\n",
        "Как\nМалам\nРадар\nЯ\nв\nи\n",
        "palindromes mixed length test",
    ),
    (
        "Дом Кот Лиса Окно\nБеседа на природе\nЧеловек идет по улице\n",
        "",
        "no palindrome, no single letter test",
    ),
]
