g_test_data = [
    ("1\n", "Купи слона!\n\n"),
    ("3\n", "Купи слона!\nКупи слона!\nКупи слона!\n\n"),
    ("0\n", "\n"),
    (
        "5\n",
        "Купи слона!\nКупи слона!\nКупи слона!\nКупи слона!\nКупи слона!\n\n",
    ),
    (
        "21\n",
        """Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!
Купи слона!

""",
    ),
]


f_test_data = [
    (
        "черешня\n2\n3\n10\n",
        {
            "Чек\nчерешня - 3кг - 2руб/кг\nИтого: 6руб\nВнесено: 10руб\nСдача: 4руб\n",  # noqa E501
            "Чек\n    черешня - 3кг - 2руб/кг\n    Итого: 6руб\n    Внесено: 10руб\n    Сдача: 4руб\n",  # noqa E501
        },
    ),
    (
        "манго\n187\n43\n8041\n",
        {
            "Чек\nманго - 43кг - 187руб/кг\nИтого: 8041руб\nВнесено: 8041руб\nСдача: 0руб\n",  # noqa E501
            "Чек\n    манго - 43кг - 187руб/кг\n    Итого: 8041руб\n    Внесено: 8041руб\n    Сдача: 0руб\n",  # noqa E501
        },
    ),
    (
        "Кирпичи\n187\n43\n108041\n",
        {
            "Чек\nКирпичи - 43кг - 187руб/кг\nИтого: 8041руб\nВнесено: 108041руб\nСдача: 100000руб\n",  # noqa E501
            "Чек\n    Кирпичи - 43кг - 187руб/кг\n    Итого: 8041руб\n    Внесено: 108041руб\n    Сдача: 100000руб\n",  # noqa E501
        },
    ),
    (
        "БаНаНы\n200\n0\n0\n",
        {
            "Чек\nБаНаНы - 0кг - 200руб/кг\nИтого: 0руб\nВнесено: 0руб\nСдача: 0руб\n",  # noqa E501
            "Чек\n    БаНаНы - 0кг - 200руб/кг\n    Итого: 0руб\n    Внесено: 0руб\n    Сдача: 0руб\n",  # noqa E501
        },
    ),
    (
        "Черная Смородина\n500\n1\n1000\n",
        {
            "Чек\nЧерная Смородина - 1кг - 500руб/кг\nИтого: 500руб\nВнесено: 1000руб\nСдача: 500руб\n",  # noqa E501
            "Чек\n    Черная Смородина - 1кг - 500руб/кг\n    Итого: 500руб\n    Внесено: 1000руб\n    Сдача: 500руб\n",  # noqa E501
        },
    ),
]


h_test_data = [
    (
        "2\nКупи слона!\n",
        """Я больше никогда не буду писать "Купи слона!"!
Я больше никогда не буду писать "Купи слона!"!\n""",
    ),
    (
        "3\nПопка дурак!\n",
        """Я больше никогда не буду писать "Попка дурак!"!
Я больше никогда не буду писать "Попка дурак!"!
Я больше никогда не буду писать "Попка дурак!"!
""",
    ),
    (
        "1\nLet's Rock!",
        """Я больше никогда не буду писать "Let's Rock!"!\n""",
    ),
    ('1\n"\n', 'Я больше никогда не буду писать """!\n'),
    (
        "3\nIt's movin'",
        """Я больше никогда не буду писать "It's movin'"!
Я больше никогда не буду писать "It's movin'"!
Я больше никогда не буду писать "It's movin'"!\n""",
    ),
]
