a_test_data = [
    ("змееед\n", ("здме\n",), "first open test"),
    ("велосипед\n", ("исолвдеп\n",), "second open test"),
    ("ффффффффффффф\n", ("ф\n",), "one letter"),
    ("111111111111\n", ("1\n",), "one digit"),
    ("1122334455 66 77 88 999\n", ("123456789 \n",), "multiple digits"),
    ("..//,,!!\n", ("./,!\n",), "punctuation"),
    (
        "12132 !! .s,dddf dwefllsjcb _ +=123\n",
        ("j+dfl3sc_w be,!21.=\n",),
        "all at once",
    ),
]

b_test_data = [
    ("змееед\nвелосипед\n", ("ед\n",), "first open test"),
    ("мама\nпапа\n", ("а\n",), "second open test"),
    ("21 \n34 ", (" \n",), "whitespace"),
    ("12345\n12345\n", ("12345\n",), "equal digits positive"),
    ("12345\n6789\n", ("\n",), "different digits negative"),
    ("!@#$%^&*()\n!@#$%^&*()\n", ("!@#$%^&*()\n",), "equal special chars"),
    (
        "!@#$2%4^s&*()\n!h@k#8$6%^&*()\n",
        ("!@#$%^&*()\n",),
        "noisy special chars",
    ),
]

c_test_data = [
    (
        "3\n"
        "березка елочка зайка волк березка\n"
        "сосна зайка сосна елочка зайка медведь\n"
        "сосна сосна сосна белочка сосна белочка\n",
        [
            "сосна\n"
            "березка\n"
            "волк\n"
            "елочка\n"
            "медведь\n"
            "белочка\n"
            "зайка\n",
        ],
        "first open test",
    ),
    (
        "4\nзайка березка\n"
        "березка зайка\n"
        "березка елочка березка\n"
        "елочка елочка елочка\n",
        ["березка\nелочка\nзайка\n"],
        "second open test",
    ),
]
d_test_data = [
    (
        "3\n2\nВасильев\nПетров\nВасечкин\nИванов\nМихайлов\n",
        "Таких нет\n",
        "first open test",
    ),
    (
        "3\n3\nИванов\n"
        "Петров\n"
        "Васечкин\n"
        "Иванов\n"
        "Петров\n"
        "Васечкин\n",
        "3\n",
        "second open test",
    ),
]

e_test_data = [
    (
        "3\n2\nВасильев\nПетров\nВасечкин\nИванов\nМихайлов\n",
        "5\n",
        "first open test",
    ),
    (
        "3\n3\nИванов\n"
        "Петров\n"
        "Васечкин\n"
        "Иванов\n"
        "Петров\n"
        "Васечкин\n",
        "Таких нет\n",
        "second open test",
    ),
    (
        "0\n6\nИванов\n"
        "Петров\n"
        "Васечкин\n"
        "Иванов\n"
        "Петров\n"
        "Васечкин\n",
        "6\n",
        "second porridge lovers",
    ),
    (
        "5\n0\nИванов\nПетров\nВасечкин\nИванов\nПетров\n",
        "5\n",
        "first porridge lovers",
    ),
]
