a_test_data = [
    (
        "Раз!\nДва!\nТри!\n",
        "Режим ожидания...\nРежим ожидания...\nЁлочка, гори!\n",
        "first open test",
    ),
    (
        "Десять!\nДевять!\nРаз!\nТри!\n",
        "Режим ожидания...\nРежим ожидания...\nРежим ожидания...\nЁлочка, гори!\n",
        "second open test",
    ),
    (
        "Три!\nДва!\nРаз!\nРаз!\n",
        "Ёлочка, гори!\n",
        "first word",
    ),
    (
        "Тринадцать!\nТридцать!\nТри!\n",
        "Режим ожидания...\nРежим ожидания...\nЁлочка, гори!\n",
        "subset test",
    ),
    (
        "Тридцать три!\nТри!\n",
        "Режим ожидания...\nЁлочка, гори!\n",
        "33 test",
    ),
]


b_test_data = [
    (
        "березка елочка зайка волк березка\n"
        "сосна сосна сосна елочка грибочки медведь\n"
        "сосна сосна сосна белочка сосна белочка\n"
        "Приехали!\n",
        "1\n",
        "first open test",
    ),
    (
        "зайка березка\n"
        "березка зайка\n"
        "березка елочка березка\n"
        "Приехали!\n",
        "2\n",
        "second open test",
    ),
    (
        "березка елочка лиса волк березка\n"
        "сосна сосна сосна елочка грибочки медведь\n"
        "сосна сосна сосна белочка сосна белочка\n"
        "Приехали!\n",
        "0\n",
        "no bunnies",
    ),
    (
        "зайка елочка зайка волк березка\n"
        "сосна зайка сосна елочка грибочки медведь\n"
        "зайка сосна сосна зайка сосна зайка\n"
        "Приехали!\n",
        "3\n",
        "many bunnies",
    ),
    (
        "елочка волк елочка волк елочка волк березка\n"
        "\n"
        "зайка сосна сосна зайка сосна зайка\n"
        "Приехали!\n",
        "1\n",
        "empty string",
    ),
    (
        "\n"
        "елочка волк елочка волк елочка волк березка\n"
        "зайка сосна сосна зайка сосна зайка\n"
        "Приехали!\n",
        "1\n",
        "first empty string",
    ),
    (
        "зайка\n"
        "елочка волк елочка волк елочка волк березка зайка\n"
        "зайка сосна сосна зайка сосна зайка\n"
        "зайка\n"
        "елочка волк елочка волк елочка волк березка зайка\n"
        "зайка сосна сосна зайка сосна зайка\n"
        "зайка\n"
        "елочка волк елочка волк елочка волк березка зайка\n"
        "зайка сосна сосна зайка сосна зайка\n"
        "Приехали!\n",
        "9\n",
        "bunnie in every row",
    ),
]


c_test_data = [
    ("1\n10\n", "1 2 3 4 5 6 7 8 9 10\n", "first open test"),
    ("-3\n3\n", "-3 -2 -1 0 1 2 3\n", "second open test"),
    ("1\n2\n", "1 2\n", "small distance"),
    ("-2\n-1\n", "-2 -1\n", "small distance negative"),
    ("99\n102\n", "99 100 101 102\n", "around a hundred"),
    ("-10\n0\n", "-10 -9 -8 -7 -6 -5 -4 -3 -2 -1 0\n", "negative to zero"),
    ("0\n9\n", "0 1 2 3 4 5 6 7 8 9\n", "zero to nine"),
    ("10\n19\n", "10 11 12 13 14 15 16 17 18 19\n", "ten to nineteen"),
]


d_test_data = [
    ("1\n10\n", "1 2 3 4 5 6 7 8 9 10\n", "first open test"),
    ("3\n-3\n", "3 2 1 0 -1 -2 -3\n", "second open test"),
    ("1\n2\n", "1 2\n", "small distance"),
    ("-2\n-1\n", "-2 -1\n", "small distance negative"),
    ("99\n102\n", "99 100 101 102\n", "around a hundred"),
    ("-10\n0\n", "-10 -9 -8 -7 -6 -5 -4 -3 -2 -1 0\n", "negative to zero"),
    ("0\n9\n", "0 1 2 3 4 5 6 7 8 9\n", "zero to nine"),
    ("10\n19\n", "10 11 12 13 14 15 16 17 18 19\n", "ten to nineteen"),
    (
        "-10\n-19\n",
        "-10 -11 -12 -13 -14 -15 -16 -17 -18 -19\n",
        "negative ten to neg nineteen",
    ),
    ("-3\n3\n", "-3 -2 -1 0 1 2 3\n", "neg to pos through zero"),
]


e_test_data = [
    ("100\n500\n333\n0\n", "883.0\n", "first open test"),
    ("512\n499\n342.50\n0\n", "1302.3\n", "second open test"),
    ("100\n499\n1\n0\n", "600.0\n", "no discount"),
    ("499.99\n0.03\n342.99\n0\n", "843.01\n", "floats no discount"),
    ("599.99\n500.02\n542.99\n0\n", "1478.7\n", "floats with discount"),
    (
        "1_000_000_000_000\n499_000_000_000_000\n342_000_000_000_000.50\n0\n",
        "757800000000000.5\n",
        "huge numbers",
    ),
]
